In [89]:
import pandas as pd
 
data = {'Name':['Tom191', 'nick256', 'krish356', 'jack456'],
        'Dates':['05032021','16032021','28032021','28032021']}
 
df1 = pd.DataFrame(data)

df1['Dates'] = pd.to_datetime(df1['Dates'], format='%d%m%Y')

In [90]:
data = {'Name':['Lucas1yu', 'nick2yu', 'krish3yu', 'jack4yu', 'jack5yu', 'jack6yu', 'Erika7yu', 'Joice8yu'],
        'Dates':['05032021','16032021','28032021','28032021', '05032021','16032021', '05032021', '16032021']}
 
df2 = pd.DataFrame(data)

df2['Dates'] = pd.to_datetime(df2['Dates'], format='%d%m%Y')

In [91]:
data = {'Name':['Zack', 'Luiza'],
        'Dates':['05032021','16032021'], 
        }
 
df3 = pd.DataFrame(data)

df3['Dates'] = pd.to_datetime(df3['Dates'], format='%d%m%Y')


data = {'Name':['Zack1', 'Luiza1', 'Zack2', 'Luiza2', 'Zack3', 'Luiza3', 'Zack1', 'Zack13', 'Zack14'],
        'Dates':['05032021','16032021', '05032021','16032021', '05032021','16032021','16032021','16032021','16032021'], 
        'Compra':[ 5, 10 , 21 , 6 , 7 , 1 , 11 , 1 , 11]
        }
 
df4 = pd.DataFrame(data)

df4['Dates'] = pd.to_datetime(df4['Dates'], format='%d%m%Y')


data = {'Name':['Zack16', 'Luiza16', 'Zack26', 'Luiza7', 'Zack9'],
        'Dates':['05032021','16032021', '05032021','16032021', '05032021'], 
        'Compra':[ 5, 10 , 21 , 6 , 7 ]
        }
 
df5 = pd.DataFrame(data)

df5['Dates'] = pd.to_datetime(df4['Dates'], format='%d%m%Y')

In [92]:
data_sets = [df1, df2, df3, df4]

In [93]:
df = pd.DataFrame()

df_0 = data_sets[0] 
len_df_0 = len(list(df_0['Name'].unique()))
mult0 = len_df_0  
df_total = pd.concat([df, df_0])

In [94]:
df_total

       Name      Dates
0    Tom191 2021-03-05
1   nick256 2021-03-16
2  krish356 2021-03-28
3   jack456 2021-03-28

In [95]:
df_1 = data_sets[1] 
df_1 = df_1[~df_1['Name'].isin(df_0['Name'].unique())]
len_df_1 = len(list(df_1['Name'].unique()))
mult1 = len_df_1  
df_total = pd.concat([df_total, df_1], ignore_index=True)

In [96]:
df_total

        Name      Dates
0     Tom191 2021-03-05
1    nick256 2021-03-16
2   krish356 2021-03-28
3    jack456 2021-03-28
4   Lucas1yu 2021-03-05
5    nick2yu 2021-03-16
6   krish3yu 2021-03-28
7    jack4yu 2021-03-28
8    jack5yu 2021-03-05
9    jack6yu 2021-03-16
10  Erika7yu 2021-03-05
11  Joice8yu 2021-03-16

In [97]:
df_2 = data_sets[2] 
df_2 = df_2[~df_2['Name'].isin(df_total['Name'].unique())]
len_df_2 = len(list(df_2['Name'].unique()))
df_total = pd.concat([df_total, df_2], ignore_index=True)

In [98]:
df_total

        Name      Dates
0     Tom191 2021-03-05
1    nick256 2021-03-16
2   krish356 2021-03-28
3    jack456 2021-03-28
4   Lucas1yu 2021-03-05
5    nick2yu 2021-03-16
6   krish3yu 2021-03-28
7    jack4yu 2021-03-28
8    jack5yu 2021-03-05
9    jack6yu 2021-03-16
10  Erika7yu 2021-03-05
11  Joice8yu 2021-03-16
12      Zack 2021-03-05
13     Luiza 2021-03-16

In [99]:
mult_total = len_df_0 + len_df_1

In [100]:
print('Número de nomes adicionados ' , mult_total)
print( 'Novo dataframe devera ter ', len(df_total) + mult_total , ' nomes' )

Número de nomes adicionados  12
Novo dataframe devera ter  26  nomes

In [101]:
df_4 = df4[~df4['Name'].isin(df_total['Name'].unique())]
df_4 = df_4.sort_values('Compra',ascending=False)
df_4 = df_4.reset_index(drop=True)

In [102]:
print(df_total)

        Name      Dates
0     Tom191 2021-03-05
1    nick256 2021-03-16
2   krish356 2021-03-28
3    jack456 2021-03-28
4   Lucas1yu 2021-03-05
5    nick2yu 2021-03-16
6   krish3yu 2021-03-28
7    jack4yu 2021-03-28
8    jack5yu 2021-03-05
9    jack6yu 2021-03-16
10  Erika7yu 2021-03-05
11  Joice8yu 2021-03-16
12      Zack 2021-03-05
13     Luiza 2021-03-16

In [103]:
if len(list(df_4['Name'].unique())) <= mult_total:
    df_total = pd.concat([df_total, df_4], ignore_index=True)
    #print("Executado")
    mult_total =  mult_total - len(list(df_4['Name'].unique()))
    print('Número de nomes  restantes ' , mult_total)
    print(df_total)

else:
    df_total = pd.concat([df_total, df_4[:mult_total]], ignore_index=True)
    print("Dataframe completo com ", len(df_total))

Número de nomes  restantes  4
        Name      Dates  Compra
0     Tom191 2021-03-05     NaN
1    nick256 2021-03-16     NaN
2   krish356 2021-03-28     NaN
3    jack456 2021-03-28     NaN
4   Lucas1yu 2021-03-05     NaN
5    nick2yu 2021-03-16     NaN
6   krish3yu 2021-03-28     NaN
7    jack4yu 2021-03-28     NaN
8    jack5yu 2021-03-05     NaN
9    jack6yu 2021-03-16     NaN
10  Erika7yu 2021-03-05     NaN
11  Joice8yu 2021-03-16     NaN
12      Zack 2021-03-05     NaN
13     Luiza 2021-03-16     NaN
14     Zack2 2021-03-05    21.0
15     Zack1 2021-03-16    11.0
16    Zack14 2021-03-16    11.0
17    Luiza1 2021-03-16    10.0
18     Zack3 2021-03-05     7.0
19    Luiza2 2021-03-16     6.0
20     Zack1 2021-03-05     5.0
21    Luiza3 2021-03-16     1.0
22    Zack13 2021-03-16     1.0

In [104]:
df_5 = df5[~df5['Name'].isin(df_total['Name'].unique())]
df_5 = df_5.sort_values('Compra',ascending=False)
df_5 = df_5.reset_index(drop=True)

In [105]:
if len(list(df_5['Name'].unique())) <= mult_total:
    df_total = pd.concat([df_total, df_5], ignore_index=True)
    print("Executado")
    mult_total =  mult_total - len(list(df_5['Name'].unique()))
    print('Número de nomes  restantes ' , mult_total)
else:
    #print("Não executado")
    df_total = pd.concat([df_total, df_5[:mult_total]], ignore_index=True)
    print("Dataframe completo com ", len(df_total['Name'].unique()))
    print(df_total)

Dataframe completo com  26
        Name      Dates  Compra
0     Tom191 2021-03-05     NaN
1    nick256 2021-03-16     NaN
2   krish356 2021-03-28     NaN
3    jack456 2021-03-28     NaN
4   Lucas1yu 2021-03-05     NaN
5    nick2yu 2021-03-16     NaN
6   krish3yu 2021-03-28     NaN
7    jack4yu 2021-03-28     NaN
8    jack5yu 2021-03-05     NaN
9    jack6yu 2021-03-16     NaN
10  Erika7yu 2021-03-05     NaN
11  Joice8yu 2021-03-16     NaN
12      Zack 2021-03-05     NaN
13     Luiza 2021-03-16     NaN
14     Zack2 2021-03-05    21.0
15     Zack1 2021-03-16    11.0
16    Zack14 2021-03-16    11.0
17    Luiza1 2021-03-16    10.0
18     Zack3 2021-03-05     7.0
19    Luiza2 2021-03-16     6.0
20     Zack1 2021-03-05     5.0
21    Luiza3 2021-03-16     1.0
22    Zack13 2021-03-16     1.0
23    Zack26 2021-03-05    21.0
24   Luiza16 2021-03-16    10.0
25     Zack9 2021-03-05     7.0
26    Luiza7 2021-03-16     6.0